{
  "metadata": {
    "Brakes": {
      "Video1.mp3": {
        "audio_file": "Video1.mp3",
        "author": "Markus",
        "category": "Brakes",
        "date": "2025-12-12",
        "transcription": {
          "text": " And today we're taking a look at how to change your car's brake pad. And this is so simple, anyone could do. And these are the things that you're gonna need. You're gonna need a jack to raise your car, some jack stands to hold your car from falling, a ratchet set, a brake depressor, and some wheel shocks. And remember, everything used on the video, we're gonna leave a link on the description of the video. A pro tip, using gloves will make it easier for you to clean your hands later on. The first thing that we want to do is press the emergency brake. If it's a foot pedal, press it down. If it's a hand lever, pick it up. Now we want to go ahead and place the wheel shocks because the last thing we want in a clear sunny day is to die. Let's go ahead and place our jack under the vehicle, but we're still not gonna raise it. If you have a wheel cover, we go ahead and remove that now. We're gonna take our nut remover bar and brake each nut. And you want to do this with the car on the floor because it will be a lot easier, unless you have an impact drill. If you notice, we're missing a nut and ball on our front tire. We're gonna do a wheel hub replacement video. If you're interested on that, we're gonna leave a link on the description. Now that the nuts are loose, we can go ahead and start jacking up the car. Once up, we can adjust the jack stand and place it under the vehicle. If you need to raise the vehicle a little bit more, go ahead. We can lower the vehicle slowly to our jack stand. Let's go ahead and finish removing the nuts. Go ahead and remove the wheel. And for extra precaution, we like to place the wheel under the vehicle. In case for any reason, the vehicle drops, it has something else to avoid it from hitting the floor. Now we have access to our brake caliper. And from here, if you're not sure if your brakes are wasted from the slots and using a flashlight or your cell phone, you can look inside and verify how your brakes are doing. The first thing that we want to do is remove the caliper. And like that, we will have access to our brake pads. There are two screws that hold the caliper in place, one in the bottom and one on the top. In our case, it's going to be a size 12. In your case, it may be different. If you have a set, you can go ahead and try starting at 12 and either going up a number or down a number. And like that, keep going until you find yours. The first thing that we're going to do, we're going to go ahead and break the nut, usually lefty-loosey, righty-tidy. And you do that thinking looking at the ball, which is the left and which is the right. So from the angle that we're looking at the ball, it's going to be to the right. But if you stand right behind the ball, looking at it straight, it's going to be the left. Once you break the initial pressure, you can basically take it off with your hands. If you notice it's too tight, you can play some W40 and wait a couple of minutes or hours and then try it. Let's go ahead and do the same for the bottom one as well. Now we can go ahead and remove the catapult. You may need to wiggle them out, but they should come out with ease. We can take a piece of rope or zip ties and tie it to a part of a vehicle that it won't be in your way or fall down. And remember, when removing the catapult, remember that it's connected to the brake fluid line. You don't want to pull it too hard or too far away from the vehicle. Now we remove the brake pads to the side. You may need to wiggle them out, but they should come out with ease. In our case, we still have brakes left, but because we're changing the wheel hub, we decided to change them anyways. As you can see, one of the clips came off with the brake pad. The only thing we have to do is just look at the other one and see how they're placed and put them back. If you notice your brake hardware are bad, this would be the time to also change it. You may have two types of brakes. One with a little stick on it, and that's the one that squeals when the brakes are wasting. That little stick rubs against the metal and makes that squealing noise you hear when the brakes are finishing. A great way to know where a witch goes is by remembering how they were before. But usually the one with the stick goes on the outside part. If you want to add some brake lubricant, this would be the time to do so. We're going to do this on each end of the brake pad, and you can also do this on the outer back plate of the pad. And remember, you don't want to get grease anywhere else. If you feel you need to clean your brake system, this would be the time to spray brake cleaner on it. Let's go ahead and place the new brake pads. And we basically do this the same way we took them out. We slide them back in from the side. Now we could remove the rope or the sift tie from the brake caliper. If you would try to place your brake caliper back, you would notice it won't fit. And that's because they're adjusted to the amount of waste that the brake pad had. Now placing the new ones, you would need more space to place the caliper back. That's why we're going to use the brake depressor. If you're interested on that tool, we're going to leave a link on the description. And to do that, we take one of the old brake pads, we place it next to the cylinder, and we place the brake depressor on the other side of the metal, and start twisting. If you don't have a brake depressor, you can also use the old brake pad and push it down. You can use your mega hands or anything you can use to depress the cylinder. Now that we have enough space on the caliper, we can go ahead and place it back. We can take our two bolts back and place them by hand. Once we can't tighten them by hand, we go ahead and use the ratchet. And basically, you want to tighten them as most as you can with your hands. To give you an idea, it's like tightening your tire nuts back on your wheel. You want them tight, but you don't want to over tighten them. If you haven't removed the brake lines from your brake caliper, you don't have to bleed the brake line. Well, pro tip, you can always use an empty bottle of water to catch the brake line fluid if you're ever going to do so. If you're interested on how to bleed your brake lines, we'll have a link on the description for that video as well. You can go ahead and place the wheel back. Now you can pad yourself on the back for a job well done. And now that you've done one side, now you can repeat the same process to the other side. And once you turn on your car and get behind the wheel, you should be able to pump your brakes a couple of times on parking and that should get you back to normal. If you notice air still on your brakes, then you might need to bleed your brake lines. Don't forget, if you like the video, please give us a thumbs up. That really helps. If you have any questions, place them in the comment section below. Don't forget to subscribe. Follow us on social media. Thank you for watching and here's a link to our latest video.",
          "segments": [
            {
              "start": 0.0,
              "end": 39.120000000000005,
              "text": "And today we're taking a look at how to change your car's brake pad. And this is so simple, anyone could do. And these are the things that you're gonna need. You're gonna need a jack to raise your car, some jack stands to hold your car from falling, a ratchet set, a brake depressor, and some wheel shocks. And remember, everything used on the video, we're gonna leave a link on the description of the video. A pro tip, using gloves will make it easier for you to clean your hands later on. The first thing that we want to do is press"
            },
            {
              "start": 39.120000000000005,
              "end": 78.24000000000001,
              "text": "the emergency brake. If it's a foot pedal, press it down. If it's a hand lever, pick it up. Now we want to go ahead and place the wheel shocks because the last thing we want in a clear sunny day is to die. Let's go ahead and place our jack under the vehicle, but we're still not gonna raise it. If you have a wheel cover, we go ahead and remove that now. We're gonna take our nut remover bar and brake each nut. And you want to do this with the car on the floor because it will be a lot easier, unless you have an impact drill. If you notice,"
            },
            {
              "start": 78.24,
              "end": 138.8,
              "text": "we're missing a nut and ball on our front tire. We're gonna do a wheel hub replacement video. If you're interested on that, we're gonna leave a link on the description. Now that the nuts are loose, we can go ahead and start jacking up the car. Once up, we can adjust the jack stand and place it under the vehicle. If you need to raise the vehicle a little bit more, go ahead. We can lower the vehicle slowly to our jack stand. Let's go ahead and finish removing the nuts. Go ahead and remove the wheel. And for extra precaution, we like to place the wheel"
            },
            {
              "start": 138.8,
              "end": 177.28,
              "text": "under the vehicle. In case for any reason, the vehicle drops, it has something else to avoid it from hitting the floor. Now we have access to our brake caliper. And from here, if you're not sure if your brakes are wasted from the slots and using a flashlight or your cell phone, you can look inside and verify how your brakes are doing. The first thing that we want to do is remove the caliper. And like that, we will have access to our brake pads. There are two screws that hold the caliper in place, one in the bottom and one"
            },
            {
              "start": 177.28,
              "end": 211.52,
              "text": "on the top. In our case, it's going to be a size 12. In your case, it may be different. If you have a set, you can go ahead and try starting at 12 and either going up a number or down a number. And like that, keep going until you find yours. The first thing that we're going to do, we're going to go ahead and break the nut, usually lefty-loosey, righty-tidy. And you do that thinking looking at the ball, which is the left and which is the right. So from the angle that we're looking at the ball, it's going to be to the right. But if you stand right behind the ball,"
            },
            {
              "start": 211.52,
              "end": 259.68,
              "text": "looking at it straight, it's going to be the left. Once you break the initial pressure, you can basically take it off with your hands. If you notice it's too tight, you can play some W40 and wait a couple of minutes or hours and then try it. Let's go ahead and do the same for the bottom one as well. Now we can go ahead and remove the catapult. You may need to wiggle them out, but they should come out with ease. We can take a piece of rope or zip ties and tie it to a part of a vehicle that it won't be in your way or fall down. And remember, when removing the catapult,"
            },
            {
              "start": 259.68,
              "end": 311.52,
              "text": "remember that it's connected to the brake fluid line. You don't want to pull it too hard or too far away from the vehicle. Now we remove the brake pads to the side. You may need to wiggle them out, but they should come out with ease. In our case, we still have brakes left, but because we're changing the wheel hub, we decided to change them anyways. As you can see, one of the clips came off with the brake pad. The only thing we have to do is just look at the other one and see how they're placed and put them back. If you notice your brake hardware are bad, this would be the"
            },
            {
              "start": 311.52,
              "end": 360.08000000000004,
              "text": "time to also change it. You may have two types of brakes. One with a little stick on it, and that's the one that squeals when the brakes are wasting. That little stick rubs against the metal and makes that squealing noise you hear when the brakes are finishing. A great way to know where a witch goes is by remembering how they were before. But usually the one with the stick goes on the outside part. If you want to add some brake lubricant, this would be the time to do so. We're going to do this on each end of the brake pad, and you can also do this on the outer back plate of the pad. And"
            },
            {
              "start": 360.08000000000004,
              "end": 422.8,
              "text": "remember, you don't want to get grease anywhere else. If you feel you need to clean your brake system, this would be the time to spray brake cleaner on it. Let's go ahead and place the new brake pads. And we basically do this the same way we took them out. We slide them back in from the side. Now we could remove the rope or the sift tie from the brake caliper. If you would try to place your brake caliper back, you would notice it won't fit. And that's because they're adjusted to the amount of waste that the brake pad had. Now placing the new ones, you would need more space to place the"
            },
            {
              "start": 422.8,
              "end": 464.8,
              "text": "caliper back. That's why we're going to use the brake depressor. If you're interested on that tool, we're going to leave a link on the description. And to do that, we take one of the old brake pads, we place it next to the cylinder, and we place the brake depressor on the other side of the metal, and start twisting. If you don't have a brake depressor, you can also use the old brake pad and push it down. You can use your mega hands or anything you can use to depress the cylinder. Now that we have enough space on the caliper, we can go ahead and place it back."
            },
            {
              "start": 464.8,
              "end": 534.16,
              "text": "We can take our two bolts back and place them by hand. Once we can't tighten them by hand, we go ahead and use the ratchet. And basically, you want to tighten them as most as you can with your hands. To give you an idea, it's like tightening your tire nuts back on your wheel. You want them tight, but you don't want to over tighten them. If you haven't removed the brake lines from your brake caliper, you don't have to bleed the brake line. Well, pro tip, you can always use an empty bottle of water to catch the brake line fluid if you're ever going to do so. If you're interested on how to bleed"
            },
            {
              "start": 534.16,
              "end": 572.64,
              "text": "your brake lines, we'll have a link on the description for that video as well. You can go ahead and place the wheel back. Now you can pad yourself on the back for a job well done. And now that you've done one side, now you can repeat the same process to the other side. And once you turn on your car and get behind the wheel, you should be able to pump your brakes a couple of times on parking and that should get you back to normal. If you notice air still on your brakes, then you might need to bleed your brake lines. Don't forget, if you like the video,"
            },
            {
              "start": 572.64,
              "end": 594.4,
              "text": "please give us a thumbs up. That really helps. If you have any questions, place them in the comment section below. Don't forget to subscribe. Follow us on social media. Thank you for watching and here's a link to our latest video."
            }
          ],
          "language": "en",
          "duration": null
        }
      },
      "Video2.mp3": {
        "audio_file": "Video2.mp3",
        "author": "Markus",
        "category": "Brakes",
        "date": "2025-12-12",
        "transcription": {
          "text": " In this video, we're going over some of the common install mistakes when doing your own brakes. So don't do any of these. We're going to break this down into four categories. We're going to start with the brake pads, then the rotors, the caliper, and then the hydraulic system. Overall, brakes are not that complicated, but there's many ways to mess them up. For instance, putting the brake pads on backwards. So we're going to start the video out by putting them on backwards and showing you what happens. Let's look at the damage that was done. Obviously, the rotor has grooved because of the back of the pads were in there. Now this was extremely hot. It took us a while to let this cool down. There was a lot of metal that was hot in the back of the pad. So if these were brand new and you just did this, you basically ruined everything. You're going to need new rotors again, and you're going to need new pads. We were only driving around in a parking lot about 25 miles an hour. So just imagine what this would be like if you drove down the road. If your brake pad looks like this, then it's on the wrong way. That's how it should look. When you pull the old brake pads out, check them, compare them with the new brake pads, and make sure they look very similar. They don't have to be exact. Some will have this line right here. Some may not have the line at all. Some may even have two lines. Make sure the ends of the pads look the same, and that's going to line up fine. And see if there's any dimples on the pads. So this is the outer pad. There's no dimples on it. If you look at, this pad has some dimples on it. So there's a dimple, and then there's a squealer. And if we put this pad on the outside, it's going to ride up not necessarily on that dimple, but where the squealer is. So it's going to make the pad not sit flat. So this is an inboard pad. Since we're talking about squealers, some pads have squealers, and you want to match those up to where they came off. But when you're in doubt, most of the time the squealers are at the top or where the rotor cuts into the pad. If the pads are on the back, then it would be on the bottom. Pads are on the front. They're going to be at the top. If you're putting grease on the pad, you can put grease on the ends just like that. Some people put grease on the backside to keep it from squealing. Don't put too much grease though. You don't want to put a lot on. You definitely don't want to put grease on the pad material. And if you have greasy hands, don't be wiping down the pads, because that's not going to be good. You're going to have a problem stopping. While we're talking about brake pads, let's talk about the brake caliper bracket where the brake pads sit. Now you have these pad slides or anti-rattle clips to keep the pads in there and keep them from rattling around a lot. If you put these on wrong, you could have them rubbing against the rotor, or sometimes they are side-specific and they will cause other issues. So make sure you put these on right and make sure they're not rubbing on the rotor. Make sure you either reuse these if you want to clean them up a little bit, use a wire brush or get new ones. Sometimes they come with the brake pads. You don't want to just throw them out. You don't want to just take the brake pad, slide them on there. They will fit, but then they're going to rattle around while you're going down the road. That's not going to be good. The brake caliper bracket itself, if it's rusty, you want to clean these up, use a wire brush underneath where those pads slides go, or the pads are going to stick in this bracket. It's going to cause too much material touching the brake rotor, and it's going to cause your brakes to wear so much faster. These slide pins sometimes get bound up if any moisture gets in there, if it's not sealed properly. So if you don't take these out and clean them, lubricate them, that's going to happen. And make sure you seal these properly. So make sure those are removable so that looks good. Now it's pretty obvious you're not going to install it that way with the bolt holes on the outside, but you definitely want to make sure you don't mix them up side to side. Sometimes these are machined differently, and you want to make sure that you got the right side with the right caliper. Now let's talk about the rotor. When you're taking the rotor off, if you can just grab it and slide it off, that's great. If not, you can use a hammer. Just tap on these locations. Just be careful not to hit the studs. Now normally you don't want to hit the rotor itself just in case you can't reuse it. If you're having trouble getting this off, you can always spray some rust penetrant in the holes, let it soak a little bit. If you're still having trouble, you can tap the rotor from the backside, but you better make sure you get that rotor off. If you don't, then you're going to have marks in the rotor, and if you had to reuse it, it's not going to be good. We had a lot of trouble getting that rotor off, and one of the reasons why is because this hub surface isn't very clean. So make sure you take a wire brush and just clean up all the rust build up you can in corrosion. So make sure you don't have any specs of anything. Even something as small as a little piece of sand. If it was on there and you put the rotor on, the rotor is going to be crooked while it's going down the road and it's going to cause your pulsation. So make sure that's clean, same on the back of the rotor. If there was any rust debris on there, you got to take care of that. To prevent some of that rust, use some anti-seize, and that'll prevent the rotor from sticking and some corrosion. When you get a new rotor, a lot of times there's a protective coating, almost like a oily coating. That's to prevent rust. You want to make sure you take some brake parts cleaner, clean that off. These have a different type of coating that we don't necessarily have to do that, but we don't want to get grease on them. So if you see that, the fingerprints of grease, clean that up with some brake parts cleaner. Keep in mind the backing shields, sometimes these will be bent out or rusted. When you put the rotor on, you're going to hear that noise going down the road. And once it's all together, it's really not that easy to bend these back. Before you put it together, make sure the shield isn't rubbing on the rotor. That looks good. Let's move on to the caliper. When you're reinstalling the caliper, you need to make sure you compress this piston, and you want to do that properly. You don't want to compress it too quickly, or you're going to cause damage in the rest of the hydraulic system. You could take a caliper tool similar to this, put it there, and then it's always good to have an extra brake pad. Just use one of the old brake pads, and it just makes it a little bit easier. Then just compress it nice and slow. Another great idea while you're compressing that caliper is to open the bleeder screw. If your bleeder screws don't look too rusty, you crack open the bleeder screw, compress the caliper, then the fluid's going to come out the bleeder screw hole instead of being pushed back into the master reservoir. As you're compressing it, it's pushing fluid out the bleeder screw, and then you could close the bleeder screw right before you're done compressing it. Just snug it up. Sometimes you'll notice when you compress that caliper, the boot around here, the dust boot, sometimes expands like there's air in it. If you just take a little pick or a small screwdriver, get underneath it. Just make sure you don't stab it. If you stab it, you're going to have to replace the caliper or get a new boot. If you see fluid in here, most likely the seal inside the caliper needs to be replaced. So in that event, you're going to need a new caliper. Now when you install the caliper, you want to make sure the hose is straight. It's not twisted. A lot of times people twist the caliper, run it the wrong way on there, and the hose is twisted, then it could potentially rub on the wheel, and eventually you'll lose braking. On this vehicle, it looks pretty obvious that the caliper hose has been twisted, but on some vehicles, it's not as obvious as this. So keep in mind how that's supposed to go, how it's supposed to look. Now this has flipped the opposite way, and it's not as obvious that this isn't right. So just take the caliper, spin it around, and that's the way it should be. Sometimes people forget to put the bolts in or not torque them properly, and then the caliper is just hanging out, moving around like that. Because it does that, this caliper is going to slide out and drag on your wheel, so you'll hear the noise from that. Then you're going to need a caliper and a new wheel. When you're replacing brake hoses or brake lines, double check after you're done. Make sure you don't have fluid leaks. Go for a road test, clean it off real good, and just double check. When you're installing a caliper, make sure the bleeder screw is at the top of the caliper. If you put the wrong side on, if you put the passenger side on the driver's side, bleeder screw is going to be on the bottom, and then you're not going to be able to bleed the brakes correctly. So keep that in mind. When you're bending and making your own brake lines, make sure you put the fitting on. A lot of times you get the tool set up, it's all set. You make your flare, you forgot to put the fitting on. So put that on. Make sure you use the correct fitting tool as well. There's bubble flare and double flare. You never want to use a single flare on a brake line. When you're making your lines, make sure you don't kink the line while you're bending it. It's easy to do, and if you do it, just cut it out, start fresh, because that part of the line is going to be compromised. It's going to be weaker than the rest of it. When replacing the brake lines, you want to make sure they're as close as factory as possible. You may not be able to get nice bends like this or get it as close as this, but you don't want those lines dragging down where something can get caught on them and it can rip them down. You don't want to have them wire tied up to the exhaust or any moving components. Let's talk about fluid. The important thing is using the correct brake fluid that's required for your vehicle. Normally, it's on the cap, but definitely check the owner's manual. It's important to note it's not a good idea to use a brake fluid bottle that's already been opened. Moisture can get in there and contaminate the fluid. Most vehicles use DOT3 or DOT4 brake fluid. It's extremely important not to mix any other type of fluid in with the brake fluid. If you mix oil in it or any other type of lubricants, you're going to damage the entire system. Here we have a little experiment. We put some brake fluid here and a cap full of oil. Then we mixed it together. It looks just like regular brake fluid, but when we put one of the O-rings from this caliper in there and let it sit, we're going to see what happens. If you have contaminated brake fluid like this in your car, you're going to damage anything that's touching the rubber seals or any rubber components such as the calipers, the brake hoses, the ABS unit, and the master cylinder. We left this over the weekend. Let's take a look at it. Pull it out. You can see right off the bat. It's definitely warped. If you look close at it, it's definitely swollen the rubber. That's not good. You don't want this to be in your brake system. You don't want any oil in there. You're going to have to replace your entire brake system if this happens. In the event this happens, you're going to have all these seals leaking. The caliper is going to be leaking. If any of that fluid gets on the brake pads or even on the brake shoes, you're going to have to replace those as well. That was only a cap full of oil in this amount of brake fluid. Remember, don't mix oil and brake fluid. Don't mix anything with your brake fluid. If there's anything I missed or there's anything you've done that you probably shouldn't have done, leave me a comment below. Overall, just take your time. Do the brake job the right way. If you need to, watch some of our YouTube videos on how to repair these brakes. If you enjoyed this video or it helped you out, make sure you subscribe to our channel. Ring the bell. Turn on all notifications so you don't miss any of our videos.",
          "segments": [
            {
              "start": 0.0,
              "end": 61.239999999999995,
              "text": "In this video, we're going over some of the common install mistakes when doing your own brakes. So don't do any of these. We're going to break this down into four categories. We're going to start with the brake pads, then the rotors, the caliper, and then the hydraulic system. Overall, brakes are not that complicated, but there's many ways to mess them up. For instance, putting the brake pads on backwards. So we're going to start the video out by putting them on backwards and showing you what happens. Let's look at the damage that was done. Obviously, the rotor has grooved because of the back of the pads were in there. Now this was extremely hot."
            },
            {
              "start": 61.239999999999995,
              "end": 101.72,
              "text": "It took us a while to let this cool down. There was a lot of metal that was hot in the back of the pad. So if these were brand new and you just did this, you basically ruined everything. You're going to need new rotors again, and you're going to need new pads. We were only driving around in a parking lot about 25 miles an hour. So just imagine what this would be like if you drove down the road. If your brake pad looks like this, then it's on the wrong way. That's how it should look. When you pull the old brake pads out, check them, compare them with the new brake pads,"
            },
            {
              "start": 101.72,
              "end": 144.96,
              "text": "and make sure they look very similar. They don't have to be exact. Some will have this line right here. Some may not have the line at all. Some may even have two lines. Make sure the ends of the pads look the same, and that's going to line up fine. And see if there's any dimples on the pads. So this is the outer pad. There's no dimples on it. If you look at, this pad has some dimples on it. So there's a dimple, and then there's a squealer. And if we put this pad on the outside, it's going to ride up not necessarily on that dimple, but where the squealer is."
            },
            {
              "start": 144.96,
              "end": 180.32,
              "text": "So it's going to make the pad not sit flat. So this is an inboard pad. Since we're talking about squealers, some pads have squealers, and you want to match those up to where they came off. But when you're in doubt, most of the time the squealers are at the top or where the rotor cuts into the pad. If the pads are on the back, then it would be on the bottom. Pads are on the front. They're going to be at the top. If you're putting grease on the pad, you can put grease on the ends just like that. Some people put grease on the backside to keep it from squealing."
            },
            {
              "start": 180.32,
              "end": 216.48,
              "text": "Don't put too much grease though. You don't want to put a lot on. You definitely don't want to put grease on the pad material. And if you have greasy hands, don't be wiping down the pads, because that's not going to be good. You're going to have a problem stopping. While we're talking about brake pads, let's talk about the brake caliper bracket where the brake pads sit. Now you have these pad slides or anti-rattle clips to keep the pads in there and keep them from rattling around a lot. If you put these on wrong, you could have them rubbing against the rotor, or sometimes they are side-specific and they will cause other issues."
            },
            {
              "start": 216.48,
              "end": 248.04000000000002,
              "text": "So make sure you put these on right and make sure they're not rubbing on the rotor. Make sure you either reuse these if you want to clean them up a little bit, use a wire brush or get new ones. Sometimes they come with the brake pads. You don't want to just throw them out. You don't want to just take the brake pad, slide them on there. They will fit, but then they're going to rattle around while you're going down the road. That's not going to be good. The brake caliper bracket itself, if it's rusty, you want to clean these up, use a wire"
            },
            {
              "start": 248.04000000000002,
              "end": 284.2,
              "text": "brush underneath where those pads slides go, or the pads are going to stick in this bracket. It's going to cause too much material touching the brake rotor, and it's going to cause your brakes to wear so much faster. These slide pins sometimes get bound up if any moisture gets in there, if it's not sealed properly. So if you don't take these out and clean them, lubricate them, that's going to happen. And make sure you seal these properly. So make sure those are removable so that looks good. Now it's pretty obvious you're not going to install it that way with the bolt holes on"
            },
            {
              "start": 284.2,
              "end": 318.16,
              "text": "the outside, but you definitely want to make sure you don't mix them up side to side. Sometimes these are machined differently, and you want to make sure that you got the right side with the right caliper. Now let's talk about the rotor. When you're taking the rotor off, if you can just grab it and slide it off, that's great. If not, you can use a hammer. Just tap on these locations. Just be careful not to hit the studs. Now normally you don't want to hit the rotor itself just in case you can't reuse it. If you're having trouble getting this off, you can always spray some rust penetrant in"
            },
            {
              "start": 318.16,
              "end": 350.40000000000003,
              "text": "the holes, let it soak a little bit. If you're still having trouble, you can tap the rotor from the backside, but you better make sure you get that rotor off. If you don't, then you're going to have marks in the rotor, and if you had to reuse it, it's not going to be good. We had a lot of trouble getting that rotor off, and one of the reasons why is because this hub surface isn't very clean. So make sure you take a wire brush and just clean up all the rust build up you can in corrosion. So make sure you don't have any specs of anything."
            },
            {
              "start": 350.40000000000003,
              "end": 385.72,
              "text": "Even something as small as a little piece of sand. If it was on there and you put the rotor on, the rotor is going to be crooked while it's going down the road and it's going to cause your pulsation. So make sure that's clean, same on the back of the rotor. If there was any rust debris on there, you got to take care of that. To prevent some of that rust, use some anti-seize, and that'll prevent the rotor from sticking and some corrosion. When you get a new rotor, a lot of times there's a protective coating, almost like a oily coating. That's to prevent rust."
            },
            {
              "start": 385.72,
              "end": 432.64000000000004,
              "text": "You want to make sure you take some brake parts cleaner, clean that off. These have a different type of coating that we don't necessarily have to do that, but we don't want to get grease on them. So if you see that, the fingerprints of grease, clean that up with some brake parts cleaner. Keep in mind the backing shields, sometimes these will be bent out or rusted. When you put the rotor on, you're going to hear that noise going down the road. And once it's all together, it's really not that easy to bend these back. Before you put it together, make sure the shield isn't rubbing on the rotor. That looks good."
            },
            {
              "start": 432.64,
              "end": 466.47999999999996,
              "text": "Let's move on to the caliper. When you're reinstalling the caliper, you need to make sure you compress this piston, and you want to do that properly. You don't want to compress it too quickly, or you're going to cause damage in the rest of the hydraulic system. You could take a caliper tool similar to this, put it there, and then it's always good to have an extra brake pad. Just use one of the old brake pads, and it just makes it a little bit easier. Then just compress it nice and slow. Another great idea while you're compressing that caliper is to open the bleeder screw."
            },
            {
              "start": 466.47999999999996,
              "end": 507.91999999999996,
              "text": "If your bleeder screws don't look too rusty, you crack open the bleeder screw, compress the caliper, then the fluid's going to come out the bleeder screw hole instead of being pushed back into the master reservoir. As you're compressing it, it's pushing fluid out the bleeder screw, and then you could close the bleeder screw right before you're done compressing it. Just snug it up. Sometimes you'll notice when you compress that caliper, the boot around here, the dust boot, sometimes expands like there's air in it. If you just take a little pick or a small screwdriver, get underneath it. Just make sure you don't stab it."
            },
            {
              "start": 507.91999999999996,
              "end": 544.36,
              "text": "If you stab it, you're going to have to replace the caliper or get a new boot. If you see fluid in here, most likely the seal inside the caliper needs to be replaced. So in that event, you're going to need a new caliper. Now when you install the caliper, you want to make sure the hose is straight. It's not twisted. A lot of times people twist the caliper, run it the wrong way on there, and the hose is twisted, then it could potentially rub on the wheel, and eventually you'll lose braking. On this vehicle, it looks pretty obvious that the caliper hose has been twisted, but on some vehicles, it's not as obvious as this."
            },
            {
              "start": 544.36,
              "end": 584.0,
              "text": "So keep in mind how that's supposed to go, how it's supposed to look. Now this has flipped the opposite way, and it's not as obvious that this isn't right. So just take the caliper, spin it around, and that's the way it should be. Sometimes people forget to put the bolts in or not torque them properly, and then the caliper is just hanging out, moving around like that. Because it does that, this caliper is going to slide out and drag on your wheel, so you'll hear the noise from that. Then you're going to need a caliper and a new wheel. When you're replacing brake hoses or brake lines, double check after you're done."
            },
            {
              "start": 584.0,
              "end": 612.48,
              "text": "Make sure you don't have fluid leaks. Go for a road test, clean it off real good, and just double check. When you're installing a caliper, make sure the bleeder screw is at the top of the caliper. If you put the wrong side on, if you put the passenger side on the driver's side, bleeder screw is going to be on the bottom, and then you're not going to be able to bleed the brakes correctly. So keep that in mind. When you're bending and making your own brake lines, make sure you put the fitting on. A lot of times you get the tool set up, it's all set."
            },
            {
              "start": 612.48,
              "end": 647.4,
              "text": "You make your flare, you forgot to put the fitting on. So put that on. Make sure you use the correct fitting tool as well. There's bubble flare and double flare. You never want to use a single flare on a brake line. When you're making your lines, make sure you don't kink the line while you're bending it. It's easy to do, and if you do it, just cut it out, start fresh, because that part of the line is going to be compromised. It's going to be weaker than the rest of it. When replacing the brake lines, you want to make sure they're as close as factory as possible."
            },
            {
              "start": 647.4,
              "end": 685.08,
              "text": "You may not be able to get nice bends like this or get it as close as this, but you don't want those lines dragging down where something can get caught on them and it can rip them down. You don't want to have them wire tied up to the exhaust or any moving components. Let's talk about fluid. The important thing is using the correct brake fluid that's required for your vehicle. Normally, it's on the cap, but definitely check the owner's manual. It's important to note it's not a good idea to use a brake fluid bottle that's already been opened. Moisture can get in there and contaminate the fluid. Most vehicles use DOT3 or DOT4 brake fluid."
            },
            {
              "start": 685.08,
              "end": 721.76,
              "text": "It's extremely important not to mix any other type of fluid in with the brake fluid. If you mix oil in it or any other type of lubricants, you're going to damage the entire system. Here we have a little experiment. We put some brake fluid here and a cap full of oil. Then we mixed it together. It looks just like regular brake fluid, but when we put one of the O-rings from this caliper in there and let it sit, we're going to see what happens. If you have contaminated brake fluid like this in your car, you're going to damage anything that's touching the rubber seals or any rubber components such as the calipers, the brake"
            },
            {
              "start": 721.76,
              "end": 764.72,
              "text": "hoses, the ABS unit, and the master cylinder. We left this over the weekend. Let's take a look at it. Pull it out. You can see right off the bat. It's definitely warped. If you look close at it, it's definitely swollen the rubber. That's not good. You don't want this to be in your brake system. You don't want any oil in there. You're going to have to replace your entire brake system if this happens. In the event this happens, you're going to have all these seals leaking. The caliper is going to be leaking. If any of that fluid gets on the brake pads or even on the brake shoes, you're going to"
            },
            {
              "start": 764.72,
              "end": 796.72,
              "text": "have to replace those as well. That was only a cap full of oil in this amount of brake fluid. Remember, don't mix oil and brake fluid. Don't mix anything with your brake fluid. If there's anything I missed or there's anything you've done that you probably shouldn't have done, leave me a comment below. Overall, just take your time. Do the brake job the right way. If you need to, watch some of our YouTube videos on how to repair these brakes. If you enjoyed this video or it helped you out, make sure you subscribe to our channel. Ring the bell. Turn on all notifications so you don't miss any of our videos."
            }
          ],
          "language": "en",
          "duration": null
        }
      }
    }
  },
  "data": {
    "Brakes": {
      "Uncategorized": {
        "windows": [
          {
            "text": "In this video, we're going over some of the common install mistakes when doing your own brakes. So don't do any of these. We're going to break this down into four categories. We're going to start with the brake pads, then the rotors, the caliper, and then the hydraulic system. Overall, brakes are not that complicated, but there's many ways to mess them up. For instance, putting the brake pads on backwards. So we're going to start the video out by putting them on backwards and showing you what happens. Let's look at the damage that was done. Obviously, the rotor has grooved because of the back of the pads were in there. Now this was extremely hot.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "It took us a while to let this cool down. There was a lot of metal that was hot in the back of the pad. So if these were brand new and you just did this, you basically ruined everything. You're going to need new rotors again, and you're going to need new pads. We were only driving around in a parking lot about 25 miles an hour. So just imagine what this would be like if you drove down the road. If your brake pad looks like this, then it's on the wrong way. That's how it should look. When you pull the old brake pads out, check them, compare them with the new brake pads,",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ]
      },
      "Brake Pad Placement": {
        "windows": [
          {
            "text": "and make sure they look very similar. They don't have to be exact. Some will have this line right here. Some may not have the line at all. Some may even have two lines. Make sure the ends of the pads look the same, and that's going to line up fine. And see if there's any dimples on the pads. So this is the outer pad. There's no dimples on it. If you look at, this pad has some dimples on it. So there's a dimple, and then there's a squealer. And if we put this pad on the outside, it's going to ride up not necessarily on that dimple, but where the squealer is.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "So it's going to make the pad not sit flat. So this is an inboard pad. Since we're talking about squealers, some pads have squealers, and you want to match those up to where they came off. But when you're in doubt, most of the time the squealers are at the top or where the rotor cuts into the pad. If the pads are on the back, then it would be on the bottom. Pads are on the front. They're going to be at the top. If you're putting grease on the pad, you can put grease on the ends just like that. Some people put grease on the backside to keep it from squealing.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "time to also change it. You may have two types of brakes. One with a little stick on it, and that's the one that squeals when the brakes are wasting. That little stick rubs against the metal and makes that squealing noise you hear when the brakes are finishing. A great way to know where a witch goes is by remembering how they were before. But usually the one with the stick goes on the outside part. If you want to add some brake lubricant, this would be the time to do so. We're going to do this on each end of the brake pad, and you can also do this on the outer back plate of the pad. And",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "When changing brake pads, it's important to pay attention to details such as dimples and squealers. The outer pad typically does not have dimples, while the inner pad may have dimples as well as a squealer to indicate wear. The squealer should be positioned where it was before, usually at the top for front pads and at the bottom for rear pads. Adding grease to the ends of the pads and on the backside can help prevent squealing. For pads with a squealer, it's usually placed on the outer part. Remembering their original positions can help during replacement, and applying brake lubricant to both ends of the pad is recommended during the process."
      },
      "Brake Maintenance": {
        "windows": [
          {
            "text": "Don't put too much grease though. You don't want to put a lot on. You definitely don't want to put grease on the pad material. And if you have greasy hands, don't be wiping down the pads, because that's not going to be good. You're going to have a problem stopping. While we're talking about brake pads, let's talk about the brake caliper bracket where the brake pads sit. Now you have these pad slides or anti-rattle clips to keep the pads in there and keep them from rattling around a lot. If you put these on wrong, you could have them rubbing against the rotor, or sometimes they are side-specific and they will cause other issues.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "So make sure you put these on right and make sure they're not rubbing on the rotor. Make sure you either reuse these if you want to clean them up a little bit, use a wire brush or get new ones. Sometimes they come with the brake pads. You don't want to just throw them out. You don't want to just take the brake pad, slide them on there. They will fit, but then they're going to rattle around while you're going down the road. That's not going to be good. The brake caliper bracket itself, if it's rusty, you want to clean these up, use a wire",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "brush underneath where those pads slides go, or the pads are going to stick in this bracket. It's going to cause too much material touching the brake rotor, and it's going to cause your brakes to wear so much faster. These slide pins sometimes get bound up if any moisture gets in there, if it's not sealed properly. So if you don't take these out and clean them, lubricate them, that's going to happen. And make sure you seal these properly. So make sure those are removable so that looks good. Now it's pretty obvious you're not going to install it that way with the bolt holes on",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "Even something as small as a little piece of sand. If it was on there and you put the rotor on, the rotor is going to be crooked while it's going down the road and it's going to cause your pulsation. So make sure that's clean, same on the back of the rotor. If there was any rust debris on there, you got to take care of that. To prevent some of that rust, use some anti-seize, and that'll prevent the rotor from sticking and some corrosion. When you get a new rotor, a lot of times there's a protective coating, almost like a oily coating. That's to prevent rust.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "You want to make sure you take some brake parts cleaner, clean that off. These have a different type of coating that we don't necessarily have to do that, but we don't want to get grease on them. So if you see that, the fingerprints of grease, clean that up with some brake parts cleaner. Keep in mind the backing shields, sometimes these will be bent out or rusted. When you put the rotor on, you're going to hear that noise going down the road. And once it's all together, it's really not that easy to bend these back. Before you put it together, make sure the shield isn't rubbing on the rotor. That looks good.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "remember that it's connected to the brake fluid line. You don't want to pull it too hard or too far away from the vehicle. Now we remove the brake pads to the side. You may need to wiggle them out, but they should come out with ease. In our case, we still have brakes left, but because we're changing the wheel hub, we decided to change them anyways. As you can see, one of the clips came off with the brake pad. The only thing we have to do is just look at the other one and see how they're placed and put them back. If you notice your brake hardware are bad, this would be the",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "remember, you don't want to get grease anywhere else. If you feel you need to clean your brake system, this would be the time to spray brake cleaner on it. Let's go ahead and place the new brake pads. And we basically do this the same way we took them out. We slide them back in from the side. Now we could remove the rope or the sift tie from the brake caliper. If you would try to place your brake caliper back, you would notice it won't fit. And that's because they're adjusted to the amount of waste that the brake pad had. Now placing the new ones, you would need more space to place the",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "When working on brake pads, it's important not to use excessive grease, especially on the pad material, as it can lead to braking issues. It's crucial to correctly position the pad slides or anti-rattle clips in the brake caliper bracket to prevent rubbing against the rotor. These components should either be cleaned and reused or replaced to ensure proper functioning. Rusty caliper brackets should be cleaned with a wire brush to prevent the pads from sticking and wearing unevenly. Moisture can cause slide pins to bind up, so it's essential to clean and lubricate them properly. Additionally, ensuring the rotor is clean and free of debris is crucial to prevent pulsation while driving. Using anti-seize on the rotor can prevent sticking and corrosion. Any grease or debris on the rotor should be removed with brake parts cleaner. Pay attention to the condition of the backing shields to avoid noise while driving. When reinstalling brake parts, be cautious not to bend or damage any components. Finally, when replacing brake pads, avoid getting grease in unwanted areas and use brake cleaner as needed. Remember to handle brake hardware properly, and always ensure a tight fit when reassembling the brake components."
      },
      "Car Brake Maintenance.": {
        "windows": [
          {
            "text": "the outside, but you definitely want to make sure you don't mix them up side to side. Sometimes these are machined differently, and you want to make sure that you got the right side with the right caliper. Now let's talk about the rotor. When you're taking the rotor off, if you can just grab it and slide it off, that's great. If not, you can use a hammer. Just tap on these locations. Just be careful not to hit the studs. Now normally you don't want to hit the rotor itself just in case you can't reuse it. If you're having trouble getting this off, you can always spray some rust penetrant in",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "the holes, let it soak a little bit. If you're still having trouble, you can tap the rotor from the backside, but you better make sure you get that rotor off. If you don't, then you're going to have marks in the rotor, and if you had to reuse it, it's not going to be good. We had a lot of trouble getting that rotor off, and one of the reasons why is because this hub surface isn't very clean. So make sure you take a wire brush and just clean up all the rust build up you can in corrosion. So make sure you don't have any specs of anything.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "on the top. In our case, it's going to be a size 12. In your case, it may be different. If you have a set, you can go ahead and try starting at 12 and either going up a number or down a number. And like that, keep going until you find yours. The first thing that we're going to do, we're going to go ahead and break the nut, usually lefty-loosey, righty-tidy. And you do that thinking looking at the ball, which is the left and which is the right. So from the angle that we're looking at the ball, it's going to be to the right. But if you stand right behind the ball,",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "looking at it straight, it's going to be the left. Once you break the initial pressure, you can basically take it off with your hands. If you notice it's too tight, you can play some W40 and wait a couple of minutes or hours and then try it. Let's go ahead and do the same for the bottom one as well. Now we can go ahead and remove the catapult. You may need to wiggle them out, but they should come out with ease. We can take a piece of rope or zip ties and tie it to a part of a vehicle that it won't be in your way or fall down. And remember, when removing the catapult,",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "When working on your car brakes, be cautious not to mix up the calipers from side to side since they may be machined differently. To remove the rotor, try sliding it off if possible; if not, use a hammer gently at specific points, avoiding the studs. Avoid hitting the rotor directly, especially if you plan to reuse it. In case of difficulty, apply rust penetrant and tap the rotor from the backside while ensuring a clean hub surface free of rust and corrosion specks.\n\nFor the nuts, use the appropriate size, like 12, but it may vary, so experiment starting from 12 and adjusting up or down until you find the right fit. Twist the nut in the correct direction by considering the ball's position as left or right. Loosen the nut, then apply WD-40 if too tight and remove it once the initial resistance is released. Repeat the process for the bottom nut before removing the caliper, which may require gentle wiggling. Secure the caliper with rope or zip ties to prevent it from obstructing or falling."
      },
      "Brake Caliper Maintenance": {
        "windows": [
          {
            "text": "Let's move on to the caliper. When you're reinstalling the caliper, you need to make sure you compress this piston, and you want to do that properly. You don't want to compress it too quickly, or you're going to cause damage in the rest of the hydraulic system. You could take a caliper tool similar to this, put it there, and then it's always good to have an extra brake pad. Just use one of the old brake pads, and it just makes it a little bit easier. Then just compress it nice and slow. Another great idea while you're compressing that caliper is to open the bleeder screw.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "If your bleeder screws don't look too rusty, you crack open the bleeder screw, compress the caliper, then the fluid's going to come out the bleeder screw hole instead of being pushed back into the master reservoir. As you're compressing it, it's pushing fluid out the bleeder screw, and then you could close the bleeder screw right before you're done compressing it. Just snug it up. Sometimes you'll notice when you compress that caliper, the boot around here, the dust boot, sometimes expands like there's air in it. If you just take a little pick or a small screwdriver, get underneath it. Just make sure you don't stab it.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "If you stab it, you're going to have to replace the caliper or get a new boot. If you see fluid in here, most likely the seal inside the caliper needs to be replaced. So in that event, you're going to need a new caliper. Now when you install the caliper, you want to make sure the hose is straight. It's not twisted. A lot of times people twist the caliper, run it the wrong way on there, and the hose is twisted, then it could potentially rub on the wheel, and eventually you'll lose braking. On this vehicle, it looks pretty obvious that the caliper hose has been twisted, but on some vehicles, it's not as obvious as this.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "So keep in mind how that's supposed to go, how it's supposed to look. Now this has flipped the opposite way, and it's not as obvious that this isn't right. So just take the caliper, spin it around, and that's the way it should be. Sometimes people forget to put the bolts in or not torque them properly, and then the caliper is just hanging out, moving around like that. Because it does that, this caliper is going to slide out and drag on your wheel, so you'll hear the noise from that. Then you're going to need a caliper and a new wheel. When you're replacing brake hoses or brake lines, double check after you're done.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "Make sure you don't have fluid leaks. Go for a road test, clean it off real good, and just double check. When you're installing a caliper, make sure the bleeder screw is at the top of the caliper. If you put the wrong side on, if you put the passenger side on the driver's side, bleeder screw is going to be on the bottom, and then you're not going to be able to bleed the brakes correctly. So keep that in mind. When you're bending and making your own brake lines, make sure you put the fitting on. A lot of times you get the tool set up, it's all set.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "You make your flare, you forgot to put the fitting on. So put that on. Make sure you use the correct fitting tool as well. There's bubble flare and double flare. You never want to use a single flare on a brake line. When you're making your lines, make sure you don't kink the line while you're bending it. It's easy to do, and if you do it, just cut it out, start fresh, because that part of the line is going to be compromised. It's going to be weaker than the rest of it. When replacing the brake lines, you want to make sure they're as close as factory as possible.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "You may not be able to get nice bends like this or get it as close as this, but you don't want those lines dragging down where something can get caught on them and it can rip them down. You don't want to have them wire tied up to the exhaust or any moving components. Let's talk about fluid. The important thing is using the correct brake fluid that's required for your vehicle. Normally, it's on the cap, but definitely check the owner's manual. It's important to note it's not a good idea to use a brake fluid bottle that's already been opened. Moisture can get in there and contaminate the fluid. Most vehicles use DOT3 or DOT4 brake fluid.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "hoses, the ABS unit, and the master cylinder. We left this over the weekend. Let's take a look at it. Pull it out. You can see right off the bat. It's definitely warped. If you look close at it, it's definitely swollen the rubber. That's not good. You don't want this to be in your brake system. You don't want any oil in there. You're going to have to replace your entire brake system if this happens. In the event this happens, you're going to have all these seals leaking. The caliper is going to be leaking. If any of that fluid gets on the brake pads or even on the brake shoes, you're going to",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "under the vehicle. In case for any reason, the vehicle drops, it has something else to avoid it from hitting the floor. Now we have access to our brake caliper. And from here, if you're not sure if your brakes are wasted from the slots and using a flashlight or your cell phone, you can look inside and verify how your brakes are doing. The first thing that we want to do is remove the caliper. And like that, we will have access to our brake pads. There are two screws that hold the caliper in place, one in the bottom and one",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "caliper back. That's why we're going to use the brake depressor. If you're interested on that tool, we're going to leave a link on the description. And to do that, we take one of the old brake pads, we place it next to the cylinder, and we place the brake depressor on the other side of the metal, and start twisting. If you don't have a brake depressor, you can also use the old brake pad and push it down. You can use your mega hands or anything you can use to depress the cylinder. Now that we have enough space on the caliper, we can go ahead and place it back.",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "We can take our two bolts back and place them by hand. Once we can't tighten them by hand, we go ahead and use the ratchet. And basically, you want to tighten them as most as you can with your hands. To give you an idea, it's like tightening your tire nuts back on your wheel. You want them tight, but you don't want to over tighten them. If you haven't removed the brake lines from your brake caliper, you don't have to bleed the brake line. Well, pro tip, you can always use an empty bottle of water to catch the brake line fluid if you're ever going to do so. If you're interested on how to bleed",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "When reinstalling a caliper, it's crucial to compress the piston properly to prevent damage to the hydraulic system. Using a caliper tool and an old brake pad to compress it slowly is advised. Opening the bleeder screw while compressing allows fluid to exit through the screw hole rather than return to the reservoir. Care must be taken not to damage the dust boot when compressing the caliper and to check for any signs of a leaky seal inside. Ensuring the caliper hose is straight and not twisted when installing it is essential to prevent future rubbing and loss of braking efficiency.\n\nProper installation also involves securing the caliper with the correct torque on the bolts to prevent it from moving around and potentially causing damage to the wheel. When replacing brake hoses or lines, checking for leaks after installation is recommended. The positioning of the bleeder screw on the caliper is crucial for effective bleeding. Care must also be taken when bending brake lines to prevent kinks and using the correct fitting tool to ensure a proper flare.\n\nSelecting the right brake fluid as per the manufacturer's specifications, avoiding using opened bottles to prevent contamination, and maintaining the integrity of the brake system components are emphasized. Ensuring the brake system components are not damaged or contaminated, and making precise bends in the brake lines to prevent snagging are important considerations. Regular checks and proper maintenance are key in preserving the functionality of the brake system and ensuring safety on the road."
      },
      "Brake fluid maintenance": {
        "windows": [
          {
            "text": "It's extremely important not to mix any other type of fluid in with the brake fluid. If you mix oil in it or any other type of lubricants, you're going to damage the entire system. Here we have a little experiment. We put some brake fluid here and a cap full of oil. Then we mixed it together. It looks just like regular brake fluid, but when we put one of the O-rings from this caliper in there and let it sit, we're going to see what happens. If you have contaminated brake fluid like this in your car, you're going to damage anything that's touching the rubber seals or any rubber components such as the calipers, the brake",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "have to replace those as well. That was only a cap full of oil in this amount of brake fluid. Remember, don't mix oil and brake fluid. Don't mix anything with your brake fluid. If there's anything I missed or there's anything you've done that you probably shouldn't have done, leave me a comment below. Overall, just take your time. Do the brake job the right way. If you need to, watch some of our YouTube videos on how to repair these brakes. If you enjoyed this video or it helped you out, make sure you subscribe to our channel. Ring the bell. Turn on all notifications so you don't miss any of our videos.",
            "source_file": "Video2.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "your brake lines, we'll have a link on the description for that video as well. You can go ahead and place the wheel back. Now you can pad yourself on the back for a job well done. And now that you've done one side, now you can repeat the same process to the other side. And once you turn on your car and get behind the wheel, you should be able to pump your brakes a couple of times on parking and that should get you back to normal. If you notice air still on your brakes, then you might need to bleed your brake lines. Don't forget, if you like the video,",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "please give us a thumbs up. That really helps. If you have any questions, place them in the comment section below. Don't forget to subscribe. Follow us on social media. Thank you for watching and here's a link to our latest video.",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "It is crucial not to mix any other fluid with brake fluid as it can damage the entire braking system. A cap full of oil mixed with brake fluid can contaminate it, leading to damage to rubber components like calipers and seals. Replacing contaminated parts is necessary if this occurs. Avoid mixing brake fluid with any other substances and take the time to perform brake maintenance correctly. Watching tutorials for guidance on brake repair is recommended. After completing brake work on one side of the car, repeat the process on the other side. Ensure proper brake function by pumping the brakes when the car is turned on. If air remains in the system, bleeding the brake lines may be necessary. Liking and subscribing to informative videos can be helpful. Any questions can be asked in the comments section, and social media channels can be followed for more content."
      },
      "Brake Pad Replacement": {
        "windows": [
          {
            "text": "And today we're taking a look at how to change your car's brake pad. And this is so simple, anyone could do. And these are the things that you're gonna need. You're gonna need a jack to raise your car, some jack stands to hold your car from falling, a ratchet set, a brake depressor, and some wheel shocks. And remember, everything used on the video, we're gonna leave a link on the description of the video. A pro tip, using gloves will make it easier for you to clean your hands later on. The first thing that we want to do is press",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "the emergency brake. If it's a foot pedal, press it down. If it's a hand lever, pick it up. Now we want to go ahead and place the wheel shocks because the last thing we want in a clear sunny day is to die. Let's go ahead and place our jack under the vehicle, but we're still not gonna raise it. If you have a wheel cover, we go ahead and remove that now. We're gonna take our nut remover bar and brake each nut. And you want to do this with the car on the floor because it will be a lot easier, unless you have an impact drill. If you notice,",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          },
          {
            "text": "we're missing a nut and ball on our front tire. We're gonna do a wheel hub replacement video. If you're interested on that, we're gonna leave a link on the description. Now that the nuts are loose, we can go ahead and start jacking up the car. Once up, we can adjust the jack stand and place it under the vehicle. If you need to raise the vehicle a little bit more, go ahead. We can lower the vehicle slowly to our jack stand. Let's go ahead and finish removing the nuts. Go ahead and remove the wheel. And for extra precaution, we like to place the wheel",
            "source_file": "Video1.mp3",
            "author": "Markus",
            "date": "2025-12-12"
          }
        ],
        "summary": "Today's guide walks you through changing your car's brake pads with ease using basic tools like a jack, jack stands, a ratchet set, a brake depressor, and wheel shocks, with the necessary items conveniently linked in the video description. Wearing gloves can help keep your hands clean. Begin by engaging the emergency brake and ensuring the vehicle is secure with wheel shocks. Position the jack beneath the car, remove the wheel cover, and loosen the nuts while the car is on the ground. Lift the car, adjust the jack stand, and remove the wheel. Additional information about wheel hub replacement is available in the video description for those interested."
      }
    }
  }
}